import { HeroLink } from './hero.styled';

export const Hero = () => {
  return (
    <div>
      <h1>Раді вітати Вас у RentCars Україна</h1>
      <p>Найкращої подорожі з RentCars Україна!</p>
      <p>
        RentCars організовує для вас прокат авто в найбільших містах України
        оперативно, якісно і дешево. Набагато зручніше використовувати для
        поїздок по місту і за його межами, ніж користуватися послугами
        громадського транспорту або таксі. Ви самі керуєте своїм часом,
        замовивши наші машини в оренду. Наш комфортабельний автомобіль - це ваша
        особиста свобода, можливість вирішити більше завдань, всюди встигнути
        вчасно.
      </p>
      <p>Натисни кнопку для переходу до каталогу </p>
      <HeroLink to="/catalog">Поїхали з нами</HeroLink>
    </div>
  );
};
